<a href="https://colab.research.google.com/github/unknown-jun/Basic_of_Python/blob/master/reveiw.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
from google.colab import files
file =  files.upload()
file2 = files.upload()
file3 = files.upload()
file4 = files.upload()
file5 = files.upload()

Saving emp3.csv to emp3.csv

Saving dept3.csv to dept3 (1).csv

Saving emp2.csv to emp2 (1).csv

Saving emp122.csv to emp122 (1).csv

Saving emp1222.csv to emp1222.csv


문제 221. 부서번호, 부서번호 별 평균 월급을 출력하시오
~~~
SQL>
select detpno, avg( sal )
    from emp
    group by deptno;
~~~

In [7]:
emp = pd.read_csv("emp3.csv")
emp.groupby('deptno')[['sal']].mean().reset_index()

   deptno          sal
0      10  2916.666667
1      20  2175.000000
2      30  1566.666667


문제 222. 위의 결와에서 평균월급을 출력할 때 정수부분만 출력해라 (소수점 이전까지만 출력)

In [8]:
emp=pd.read_csv('emp3.csv')
emp.groupby('deptno')[['sal']].mean().astype(int)

         sal
deptno
10      2916
20      2175
30      1566


문제 223. 직업과 직업별 토탈월급을 출력하시오
~~~
SQL>
select job, sum( sal )
    from emp
    group by job;
~~~

In [9]:
emp.groupby('job')[['sal']].sum().astype(int)

            sal
job
ANALYST    6000
CLERK      4150
MANAGER    8275
PRESIDENT  5000
SALESMAN   5600


문제 224. 부서위치, 부서위치별 토탈월급을 출력하시오
~~~
SQL>
select d.loc, sum( e.sal )
    from emp e, dept d
    group by d.loc;
~~~

In [11]:
dept = pd.read_csv("dept3.csv")
result = pd.merge(emp, dept, how='left', on='deptno')
sum_sal=result.groupby('loc')['sal'].sum().reset_index()
sum_sal

        loc    sal
0   CHICAGO   9400
1    DALLAS  10875
2  NEW YORK   8750

문제 225. 아래의 SQL을 판다스로 구현하시오
~~~
SQL>
select d.loc, nvl( sum( e.sal ), 0 )
    from emp e, dept d
    where d.deptno = e.deptno
    group by d.loc;
~~~

In [12]:
dept = pd.read_csv("dept3.csv")
result = pd.merge(emp, dept, how= 'right', on='deptno')
sum_sal = result.groupby('loc')['sal'].sum().reset_index()
sum_sal

        loc      sal
0    BOSTON      0.0
1   CHICAGO   9400.0
2    DALLAS  10875.0
3  NEW YORK   8750.0

문제 226. 아래의 SQL을 판다스로 구현하시오
~~~
SQL>
select deptno, count(*)
    from emp
    group by deptno;
~~~

In [13]:
sum = emp.groupby('deptno')[['ename']].count()
sum

        ename
deptno
10          3
20          5
30          6